#+STARTUP: folded indent inlineimages latexpreview
#+PROPERTY: header-args:R :results value :colnames yes :session *R:rlang*

* rlang package
** environment

名前がより直感的にわかりやすい
- env(...)
- child_env(.parent, ...)
- new_environment(data = list(), parent = empty_env())

- 新たな環境を作成
#+begin_src R
suppressMessages(library(rlang))
e <- env()
e
#+end_src

#+RESULTS:
: 
: <environment: 0x55a6f6d31cc8>
: 
: <environment: 0x55a6f6d334d8>

#+begin_src R
search_envs()               # = search()
search_env("package:rlang") # = as.environment()
pkg_env("rlang")
pkg_env_name("rlang")
is_attached("package:rlang")
base_env()   # = baseenv()
global_env() # = globalenv()
empty_env()  # = emptyenv()
caller_env() # = parent.frame()
#+end_src

#+RESULTS:
#+begin_example
 [[1]] $ <env: global>
 [[2]] $ <env: package:rlang>
 [[3]] $ <env: package:pryr>
 [[4]] $ <env: package:broom>
 [[5]] $ <env: ESSR>
 [[6]] $ <env: package:stats>
 [[7]] $ <env: package:graphics>
 [[8]] $ <env: package:grDevices>
 [[9]] $ <env: package:utils>
[[10]] $ <env: package:datasets>
[[11]] $ <env: package:methods>
[[12]] $ <env: Autoloads>
[[13]] $ <env: package:base>

<environment: package:rlang>
attr(,"name")
[1] "package:rlang"
attr(,"path")
[1] "/usr/lib/R/site-library/rlang"

<environment: package:rlang>
attr(,"name")
[1] "package:rlang"
attr(,"path")
[1] "/usr/lib/R/site-library/rlang"

[1] "package:rlang"

[1] TRUE

<environment: base>

<environment: R_GlobalEnv>

<environment: R_EmptyEnv>

<environment: R_GlobalEnv>
#+end_example
